plots = {
    'chapter_1':{
        'plot':
            'Будучи {key_0}\n'
            'из расы {key_1}, вы слышите различные слухи\n'
            'о неком тёмном лорде, что разрушает эти земли.\n'
            'Вы решаете остановить его. Но на вашем пути встречается\n'
            'ваш первый враг, гоблин!\n'
            'Что вы собираетесь делать?\n',
        'enemy':
                {
                    'Name':'Гуглекс',
                    'Background':'Кому не всё равно?!',
                    'Kind/species':'Гоблин',
                    'parameters':{
                        'HP':-40, # Минус от базы (100) = 60
                        'DP':-5 # Тоже самое (10) = 5
                    }
                    
                }
    }
}