LEXICON = {'start':'Приветствую! Добро пожаловать в текстовую РПГ!\n'
           'Обдумывай свой каждый шаг, ведь он можеть стать последним!',
           'start_processing':'Для начала тебе следует выбрать\n'
           'расу и класс\n',
           'help':'/start - начать игру\n'
           '/help - получить список комманд',
           'class_processing':'Выберете класс',
           'butt_1':'Human',
           'butt_2':'Elf',
           'butt_3':'Ork',
           'butt_4':'Beastmen',
           'butt_5':'Demon',
           'butt_6':'Undead',
           'arg_0':'Yes',
           'arg_1':'No',
           'class_1':'Warrior',
           'class_2':'Mage',
           'class_3':'Rogue',
           'in_data':'Уже находится в датабазе',
           'race_data':'Характеристики расы {key_1}:\n'
                              'Очки Здоровья: {key_2}\n'
                              'Физический урон: {key_3}\n'
                              'Магический урон: {key_4}\n'
                              'Физическая защита: {key_5}\n'
                              'Магическая защита: {key_6}\n'
                              'Скорость: {key_7}\n'
                              'Удача: {key_8}\n',
            'class_data':
                'Характеристики персонажа,\n'
                'учитывая класс {key_0} и расу {key_1}:\n'
                'Очки Здоровья: {key_2}\n'
                'Физический урон: {key_3}\n'
                'Магический урон: {key_4}\n'
                'Физическая защита: {key_5}\n'
                'Магическая защита: {key_6}\n'
                'Скорость: {key_7}\n'
                'Удача: {key_8}\n'
    
    

           
           }

LEXICON_COMMANDS = {'/start':'начать игру',
           '/help':'Список команд'}